---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleSurfaceshape
source: html/d81d177d-82c3-f714-e105-83d272094a04.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleSurfaceshape Property

"Double Surface Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldDoubleSurfaceshape { get; }
```